Autodesk.Revit.DB.ElementArray
An array that contains element objects.

Autodesk.Revit.DB.ElementArray.Insert(Autodesk.Revit.DB.Element,System.Int32)
System.Int32
Insert the specified element into the array.
item: The element to be inserted into the array.
index: The element will be inserted before this index.
Returns: Returns whether the element was inserted into the array.

Autodesk.Revit.DB.ElementArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.ElementArray.ReverseIterator
Autodesk.Revit.DB.ElementArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.ElementArray.ForwardIterator
Autodesk.Revit.DB.ElementArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.ElementArray.Append(Autodesk.Revit.DB.Element)
void
Add the element to the end of the array.
item: The element to be added.

Autodesk.Revit.DB.ElementArray.Clear
void
Removes every element from the array, rendering it empty.

Autodesk.Revit.DB.ElementArray.Size
System.Int32
get
Returns the number of elements that are in the array.

Autodesk.Revit.DB.ElementArray.Item(System.Int32)
Autodesk.Revit.DB.Element
Gets or sets an element at a specified index within the array.
index: The index of the element to be set or retrieved.
Returns: Returns the element at the specified index.

Autodesk.Revit.DB.ElementArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.